УчетВУправляющихДляГит1/src/Catalogs/НастройкиИнтеграцииСБанками/НастройкиИнтеграцииСБанками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НастройкиИнтеграцииСБанками</name>
  <attributes>
    <name>ГиперссылкаДляПереходаКСпискуПлатежей</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Банки</name>
    <attributes>
      <name>Банк</name>
      <type>
        <types>CatalogRef.Банки</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УчетВУправляющихДляГит1/src/Catalogs/НастройкиИнтеграцииСБанками/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ДубльНастроек = ДубльНастроек();
	Если ЗначениеЗаполнено(ДубльНастроек) Тогда
		ЗаписьЖурналаРегистрации(ИнтеграцияСБанкамиКлиентСервер.ИмяСобытияЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Ошибка, Метаданные(), Ссылка,
			НСтр("ru = 'Есть другие настройки интеграции с таким же набором банков'"));
		ВызватьИсключение НСтр("ru = 'Есть другие настройки интеграции с таким же набором банков'")
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Константы.ПоказыватьЭлементы1СОтчетности.СоздатьМенеджерЗначения().УстановитьЗначениеПоУмолчанию();
	
КонецПроцедуры

Функция ДубльНастроек()
	
	Запрос = Новый Запрос;
	Запрос.Параметры.Вставить("Настройка", Ссылка);
	Запрос.Параметры.Вставить("Банки", Банки.ВыгрузитьКолонку("Банк"));
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
	|	НастройкиИнтеграцииСБанкамиБанки.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.НастройкиИнтеграцииСБанками.Банки КАК НастройкиИнтеграцииСБанкамиБанки
	|ГДЕ
	|	НастройкиИнтеграцииСБанкамиБанки.Банк В(&Банки)
	|	И НастройкиИнтеграцииСБанкамиБанки.Ссылка <> &Настройка";
	ДублиНастроек = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	Возврат ДублиНастроек;
	
КонецФункции

#КонецЕсли
